[
    {
        "title": "Python Tic-Tac-Toe Game",
        "content": [
            "This Python script implements a simple yet functional Tic-Tac-Toe game. Two players can play the game alternately on a 3x3 board. The program handles user inputs, checks for a winner, and declares a draw when no more moves are possible."
        ],
        "images": ["python_projects_pics/tic_tac_toe.png"],
        "description": [
            "### Key Features of the Code:",
            "1. **Board Display:** The `display` function creates a formatted string to represent the Tic-Tac-Toe board and prints it for players after every move.",
            "2. **Winner Check:** The `check_winner` function checks rows, columns, and diagonals for a winning condition and ends the game if a player wins. It also declares a draw if no spaces are left.",
            "3. **Player Moves:** The `play` function ensures that players can only place their marks on empty spaces, prompting them to try again if the field is already occupied.",
            "4. **Game Loop:** The `while True` loop alternates between the two players, allowing them to make moves, updates the board, and checks for game-ending conditions.",
            "### How It Works:",
            "- The board is initialized as a 3x3 grid filled with `.` to indicate empty spaces.",
            "- Players take turns entering their moves as coordinates (e.g., `0 1` for row 0 and column 1).",
            "- After each move, the board is displayed, and the program checks if the move led to a win or a draw.",
            "- The game ends when one player wins or all spaces are occupied.",
            "### Example Use:",
            "1. Start the game, and the empty board is displayed:",
            "   ```",
            "   ...",
            "   ...",
            "   ...",
            "   ```",
            "2. Player `O` makes the first move: `0 0`",
            "   ```",
            "   O..",
            "   ...",
            "   ...",
            "   ```",
            "3. Players alternate turns until the game ends with a win or a draw."
        ],
        "date": "2024-12-09"
    }
]
